In [ ]:
# Pandas

# used for data manipulation and analysis
# it internally used numpy
# relational data - data which is related to one another, e.g excel where data of one column is related to the data of the other column

In [15]:
# importing pandas

import pandas as pd
import numpy as np

In [ ]:
# Series
# In pandas single dimensional array is known as Series
# Series can be hetrogenous too, meaning a series can contains different data types
# Dictionaries can also passed in Series() function, here Keys are considered as indexes and values as data of series

ser = pd.Series([10,20,30,40,50])

print(type(ser))
print(ser)

<class 'pandas.core.series.Series'>
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [ ]:
# assigining index and coumn name for a series

ser1 = pd.Series([10,20,30,40,50], index=['a','b','c','d','e'], name='data values')

print(type(ser1))
print(ser1)

<class 'pandas.core.series.Series'>
a    10
b    20
c    30
d    40
e    50
Name: data values, dtype: int64

In [2]:
# Creating series using dictionary

ser2 = pd.Series({'a':10,'b':20,'c':30})

print(type(ser2))
print(ser2)

<class 'pandas.core.series.Series'>
a    10
b    20
c    30
dtype: int64

In [3]:
# Attributes of Series

print(ser2.values)
print(ser2.index)
print(ser2.dtype)
print(ser2.name)
print(ser2.shape)
print(ser2.size)
print(ser2.empty)

[10 20 30]
Index(['a', 'b', 'c'], dtype='object')
int64
None
(3,)
3
False

In [4]:
# Indexing

# positional indexing - indexing the value using the position of the data among the Series (python list indexing)
# Native indexing     - indexing the value using the index that have created automatically or by the user

print(ser2.values[0])  # positionl indexing

print(ser2.loc['b'])       # .loc[] is used for native indexing
print(ser2.iloc[1])        # .iloc is used for positional indexing

print(ser2[0])           # this type of indexing is not used in the latest version
                         # if there is a index named 0 then ser[0] picks 0 by Native indexing instead of positional indexing

10
20
20
10

/tmp/ipython-input-4-189071710.py:11: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(ser2[0])           # this type of indexing is not used in the latest version

In [7]:
print(ser2.loc[['a','b']])  # indexing multiple rows or values
print(ser2.iloc[[0, 1]])

a    10
b    20
dtype: int64
a    10
b    20
dtype: int64

In [12]:
# slicing

# loc(start:end) -> end is inclusive
# iloc(start:end)-> end is exclusinve

ser = pd.Series([10,20,30,40,50], index = [11, 12, 13, 14, 15])

print(ser.iloc[0:2])
print(ser.loc[11:14])
print(ser2.loc['a':'c'])     # .loc() function will include the end number also

11    10
12    20
dtype: int64
11    10
12    20
13    30
14    40
dtype: int64
a    10
b    20
c    30
dtype: int64

In [ ]:
# DataFrame

# the object that wraps multiple pandas series or columns are DataFrame
# it is a collection of pandas series

In [13]:
# Creating DataFrame

data = {
    'Name': ['apple', 'mango', 'grape'],
    'color': ['red', 'yellow', 'green'],
    'price': [100, 200, 300]
}

df = pd.DataFrame(data)

print(df)

    Name   color  price
0  apple     red    100
1  mango  yellow    200
2  grape   green    300

In [14]:
# creating dataframe from json type dictionary

data_1 = [
    {'Name':'apple', 'color':'red', 'price':100},
    {'Name':'mango', 'color':'yellow', 'price':200},
    {'Name':'grape', 'color':'green', 'price':300}
]

df1 = pd.DataFrame(data_1)

print(df1)

    Name   color  price
0  apple     red    100
1  mango  yellow    200
2  grape   green    300

In [17]:
data = np.array([[1, 2], [3, 4], [5, 6]])
df = pd.DataFrame(data, columns=['A', 'B'])    # columns is used to assign the column name and index is used to assign index of the row
print(df)
print(type(df))

   A  B
0  1  2
1  3  4
2  5  6
<class 'pandas.core.frame.DataFrame'>

In [19]:
# Accessing the values in dataframe

data = {
    'Name': ['apple', 'mango', 'grape'],
    'color': ['red', 'yellow', 'green'],
    'price': [100, 200, 300]
}
df = pd.DataFrame(data)

print(df['Name'])                # accessing only the 'Name' Column
print(type(df['Name']))          # single column is considered as Series in pandas

print(df[['Name', 'color']])     # accessing multiple columns
print(type(df[['Name', 'color']]))

0    apple
1    mango
2    grape
Name: Name, dtype: object
<class 'pandas.core.series.Series'>
    Name   color
0  apple     red
1  mango  yellow
2  grape   green
<class 'pandas.core.frame.DataFrame'>

In [24]:
print(df.loc[0:1])    # 1 is included
print()
print(df.iloc[0:1])   # 1 is excluded

    Name   color  price
0  apple     red    100
1  mango  yellow    200

    Name color  price
0  apple   red    100

In [ ]:
# Data Formats

# CSV
# JSON
# XML

In [27]:
# Reading data from CSV

data_csv = "https://raw.githubusercontent.com/datasciencedojo/datasets/refs/heads/master/titanic.csv"

df = pd.read_csv(data_csv)    # reading CSV file using read_csv() funciton

print(df)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [31]:
# Visuvalization

# top 5 rows
print(df.head(5))

print("="*100)

#last 5 rows
print(df.tail(5))

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
====================================================================================================
     PassengerId  Survived  Pclass                                      Name  \
886          887         0       2                     Montvila, Rev. Juozas
887          888         1       1              Graham, Miss. Margaret Edith
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
889          890         1       1                     Behr, Mr. Karl Howell
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch      Ticket   Fare Cabin Embarked
886    male  27.0      0      0      211536  13.00   NaN        S
887  female  19.0      0      0      112053  30.00   B42        S
888  female   NaN      1      2  W./C. 6607  23.45   NaN        S
889    male  26.0      0      0      111369  30.00  C148        C
890    male  32.0      0      0      370376   7.75   NaN        Q

In [33]:
# getting a columns

print(df[['Name','Age']])

                                                  Name   Age
0                              Braund, Mr. Owen Harris  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                             Allen, Mr. William Henry  35.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  27.0
887                       Graham, Miss. Margaret Edith  19.0
888           Johnston, Miss. Catherine Helen "Carrie"   NaN
889                              Behr, Mr. Karl Howell  26.0
890                                Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

In [37]:
# loc in df

print(df.loc[0])

print("="*100)

print(df.loc[0, 'Name'])      # In loc[] we can access the column using the column name

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object
====================================================================================================
Braund, Mr. Owen Harris

In [40]:
# iloc

print(df.iloc[0])

print("="*100)

print(df.iloc[0, 3])        # In loc[] we can access the column using the column index

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object
====================================================================================================
Braund, Mr. Owen Harris

In [41]:
# conditional formatting

print(df[df['Age'] > 30])

     PassengerId  Survived  Pclass  \
1              2         1       1
3              4         1       1
4              5         0       3
6              7         0       1
11            12         1       1
..           ...       ...     ...
873          874         0       3
879          880         1       1
881          882         0       3
885          886         0       3
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
6                              McCarthy, Mr. Timothy J    male  54.0      0
11                            Bonnell, Miss. Elizabeth  female  58.0      0
..                                                 ...     ...   ...    ...
873                        Vander Cruyssen, Mr. Victor    male  47.0      0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
881                                 Markun, Mr. Johann    male  33.0      0
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch    Ticket     Fare Cabin Embarked
1        0  PC 17599  71.2833   C85        C
3        0    113803  53.1000  C123        S
4        0    373450   8.0500   NaN        S
6        0     17463  51.8625   E46        S
11       0    113783  26.5500  C103        S
..     ...       ...      ...   ...      ...
873      0    345765   9.0000   NaN        S
879      1     11767  83.1583   C50        C
881      0    349257   7.8958   NaN        S
885      5    382652  29.1250   NaN        Q
890      0    370376   7.7500   NaN        Q

[305 rows x 12 columns]

In [42]:
print(df['Age'] > 30)

0      False
1       True
2      False
3       True
4       True
       ...
886    False
887    False
888    False
889    False
890     True
Name: Age, Length: 891, dtype: bool

In [54]:
# get the females who survived

# dataframe will only accept &,|,~
# it doesn't accept and, or, not

print(df[(df['Sex'] == 'female') & (df['Survived'] == 1)])        # 'and' will not work here only use '&'

     PassengerId  Survived  Pclass  \
1              2         1       1
2              3         1       3
3              4         1       1
8              9         1       3
9             10         1       2
..           ...       ...     ...
874          875         1       2
875          876         1       3
879          880         1       1
880          881         1       2
887          888         1       1

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
..                                                 ...     ...   ...    ...
874              Abelson, Mrs. Samuel (Hannah Wizosky)  female  28.0      1
875                   Najib, Miss. Adele Kiamie "Jane"  female  15.0      0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0

     Parch            Ticket     Fare Cabin Embarked
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
8        2            347742  11.1333   NaN        S
9        0            237736  30.0708   NaN        C
..     ...               ...      ...   ...      ...
874      0         P/PP 3381  24.0000   NaN        C
875      0              2667   7.2250   NaN        C
879      1             11767  83.1583   C50        C
880      1            230433  26.0000   NaN        S
887      0            112053  30.0000   B42        S

[233 rows x 12 columns]

In [56]:
# filtering the dataframe, after that only getting required columns
# df[df[conditins]][columns]  =>  df[df[conditins]] gives a dataframe and then applying [columns] on df[df[conditins]]

female_survived = df[(df['Sex'] == 'female') & (df['Survived'] == 1)][['Name', 'Age']]

print(female_survived)

                                                  Name   Age
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0
9                  Nasser, Mrs. Nicholas (Adele Achem)  14.0
..                                                 ...   ...
874              Abelson, Mrs. Samuel (Hannah Wizosky)  28.0
875                   Najib, Miss. Adele Kiamie "Jane"  15.0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  56.0
880       Shelley, Mrs. William (Imanita Parrish Hall)  25.0
887                       Graham, Miss. Margaret Edith  19.0

[233 rows x 2 columns]

In [57]:
# Female survived number

print(len(female_survived))

233

In [60]:
survived = len(df[df['Survived'] == 1])
notSurvived = len(df[df['Survived'] == 0])
total = len(df)

print("Survived     = ",survived)
print("Not survived = ",notSurvived)
print("Total        = ",total)

print("Survived Percent     = ",survived/total)
print("Not Survived Percent = ",notSurvived/total)

Survived     =  342
Not survived =  549
Total        =  891
Survived Percent     =  0.3838383838383838
Not Survived Percent =  0.6161616161616161